## Note: this notebook was used for development. A script file has been created to use for implementation.

In [1]:
# dependencies
import pandas as pd
from sqlalchemy import create_engine

### Store Medals CSV into DataFrame

In [2]:
csv_file = "Resources/medals.csv"
medals_df = pd.read_csv(csv_file)
medals_df.head()

,Year,Host_country,Host_city,Country_Name,Country_Code,Gold,Silver,Bronze
0,1896,Greece,Athens,Great Britain,GBR,2,3,2
1,1896,Greece,Athens,Hungary,HUN,2,1,3
2,1896,Greece,Athens,France,FRA,5,4,2
3,1896,Greece,Athens,United States,USA,11,7,2
4,1896,Greece,Athens,Germany,GER,6,5,2

### Create new data with select columns

In [3]:
# create new df with only the columns we need
new_medals_df = medals_df[['Year', 'Country_Name', 'Gold', 'Silver', 'Bronze']].copy()

# preview
new_medals_df.head()

   Year   Country_Name  Gold  Silver  Bronze
0  1896  Great Britain     2       3       2
1  1896        Hungary     2       1       3
2  1896         France     5       4       2
3  1896  United States    11       7       2
4  1896        Germany     6       5       2

### Rename Country_Name to Country and add column for Total Medals

In [4]:
# add column for total medals
new_medals_df['Total'] = new_medals_df['Gold'] + new_medals_df['Silver'] + new_medals_df['Bronze']

# rename 'Country_Name' column to 'Country'
cols = {'Country_Name': 'Country'}
new_medals_df.rename(columns = cols, inplace=True)

# preview
new_medals_df.head()

   Year        Country  Gold  Silver  Bronze  Total
0  1896  Great Britain     2       3       2      7
1  1896        Hungary     2       1       3      6
2  1896         France     5       4       2     11
3  1896  United States    11       7       2     20
4  1896        Germany     6       5       2     13

### Remove all data before 1980 and after 2010

In [5]:
# remove data before 1980
new_medals_df = new_medals_df[new_medals_df['Year'] >= 1980]

# remove data after 2010
new_medals_df = new_medals_df[new_medals_df['Year'] <= 2010]

# preview
new_medals_df.head()

     Year        Country  Gold  Silver  Bronze  Total
560  1980        Romania     6       6      13     25
561  1980        Hungary     7      10      15     32
562  1980         Sweden     3       3       6     12
563  1980         Poland     3      14      15     32
564  1980  Great Britain     5       7       9     21

### Store Population CSV into DataFrame

In [6]:
csv_file = "Resources/population.csv"
pop_df = pd.read_csv(csv_file)
pop_df.head()

,Unnamed: 0,1980,1981,1982,1983,1984,1985,1986,1987,1988,...,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
0,North America,320.27638,324.44694,328.62014,332.72487,336.72143,340.74811,344.89548,349.07829,353.2939,...,417.83236,422.05268,426.06238,430.26938,434.47232,438.82964,443.3473,447.67394,451.83698,456.59331
1,Bermuda,0.05473,0.05491,0.05517,0.05551,0.05585,0.05618,0.05651,0.05683,0.05717,...,0.06361,0.06418,0.06476,0.06534,0.06591,0.06644,0.06692,0.06739,0.06784,0.06827
2,Canada,24.5933,24.9,25.2019,25.4563,25.7018,25.9416,26.2038,26.5497,26.8948,...,31.37674,31.64096,31.88931,32.13476,32.38638,32.65668,32.93596,33.2127,33.48721,33.75974
3,Greenland,0.05021,0.05103,0.05166,0.05211,0.05263,0.05315,0.05364,0.0541,0.05485,...,0.05713,0.05736,0.05754,0.0577,0.05778,0.05764,0.05753,0.05756,0.0576,0.05764
4,Mexico,68.34748,69.96926,71.6409,73.36288,75.08014,76.76723,78.44243,80.12249,81.78182,...,101.24696,102.47993,103.71806,104.95959,106.2029,107.44953,108.70089,109.9554,111.21179,112.46886

### Rename column to Country

In [7]:
# rename 'Unnamed: 0' column to 'Country'
cols = {'Unnamed: 0': 'Country'}
new_pop_df = pop_df.rename(columns = cols)
new_pop_df.set_index('Country', inplace=True)

# preview
new_pop_df.head()

,1980,1981,1982,1983,1984,1985,1986,1987,1988,1989,...,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
Country,,,,,,,,,,,,,,,,,,,,,
North America,320.27638,324.44694,328.62014,332.72487,336.72143,340.74811,344.89548,349.07829,353.2939,357.68457,...,417.83236,422.05268,426.06238,430.26938,434.47232,438.82964,443.3473,447.67394,451.83698,456.59331
Bermuda,0.05473,0.05491,0.05517,0.05551,0.05585,0.05618,0.05651,0.05683,0.05717,0.05749,...,0.06361,0.06418,0.06476,0.06534,0.06591,0.06644,0.06692,0.06739,0.06784,0.06827
Canada,24.5933,24.9,25.2019,25.4563,25.7018,25.9416,26.2038,26.5497,26.8948,27.3793,...,31.37674,31.64096,31.88931,32.13476,32.38638,32.65668,32.93596,33.2127,33.48721,33.75974
Greenland,0.05021,0.05103,0.05166,0.05211,0.05263,0.05315,0.05364,0.0541,0.05485,0.05541,...,0.05713,0.05736,0.05754,0.0577,0.05778,0.05764,0.05753,0.05756,0.0576,0.05764
Mexico,68.34748,69.96926,71.6409,73.36288,75.08014,76.76723,78.44243,80.12249,81.78182,83.36684,...,101.24696,102.47993,103.71806,104.95959,106.2029,107.44953,108.70089,109.9554,111.21179,112.46886

### Transpose column to have years as index

In [8]:
# transpose
new_pop_df = new_pop_df.T
new_pop_df.head()

Country,North America,Bermuda,Canada,Greenland,Mexico,Saint Pierre and Miquelon,United States,Central & South America,Antarctica,Antigua and Barbuda,...,Sri Lanka,Taiwan,Thailand,Timor-Leste (East Timor),Tonga,U.S. Pacific Islands,Vanuatu,Vietnam,Wake Island,World
1980,320.27638,0.05473,24.5933,0.05021,68.34748,0.00599,227.22468,293.05856,NaN,0.06855,...,15.05597,17.84832,47.02576,--,0.09136,0.13796,0.11679,53.7152,NaN,4451.32679
1981,324.44694,0.05491,24.9,0.05103,69.96926,0.00601,229.46571,299.43033,NaN,0.06826,...,15.31549,18.17743,47.9365,--,0.09177,0.14283,0.12026,54.90268,NaN,4534.01064
1982,328.62014,0.05517,25.2019,0.05166,71.6409,0.00605,231.66446,305.95253,NaN,0.06801,...,15.57547,18.50139,48.82716,--,0.0922,0.14762,0.12379,56.14218,NaN,4613.94102
1983,332.72487,0.05551,25.4563,0.05211,73.36288,0.00607,233.79199,312.51136,NaN,0.06562,...,15.78446,18.80339,49.69425,--,0.09263,0.15281,0.12738,57.43635,NaN,4694.9362
1984,336.72143,0.05585,25.7018,0.05263,75.08014,0.00611,235.8249,318.87955,NaN,0.06447,...,15.97692,19.08335,50.53378,--,0.09288,0.15825,0.13103,58.76204,NaN,4775.05313

### Reorganize dataframe to have redundant years for every country

In [9]:
# reorganize table using stack and reset_index
new_pop_df = new_pop_df.stack().reset_index()
new_pop_df.head()

  level_0        Country          0
0    1980  North America  320.27638
1    1980        Bermuda    0.05473
2    1980         Canada    24.5933
3    1980      Greenland    0.05021
4    1980         Mexico   68.34748

### Rename columns

In [10]:
# rename columns as needed
cols = {'level_0': 'Year', 0: 'Population'}
new_pop_df = new_pop_df.rename(columns = cols)

# preview
new_pop_df.head()

   Year        Country Population
0  1980  North America  320.27638
1  1980        Bermuda    0.05473
2  1980         Canada    24.5933
3  1980      Greenland    0.05021
4  1980         Mexico   68.34748

In [11]:
# create list of countries in olympics data
m_countries = list(new_medals_df['Country'].unique())
m_countries

['Romania',
 'Hungary',
 'Sweden',
 'Poland',
 'Great Britain',
 'France',
 'East Germany',
 'Soviet Union',
 'Ethiopia',
 'Italy',
 'Cuba',
 'Bulgaria',
 'Tanzania',
 'Mexico',
 'Netherlands',
 'Zimbabwe',
 'North Korea',
 'Mongolia',
 'Jamaica',
 'Guyana',
 'Lebanon',
 'Ireland',
 'Uganda',
 'Venezuela',
 'Australia',
 'Denmark',
 'Brazil',
 'Finland',
 'Czechoslovakia',
 'Yugoslavia',
 'Switzerland',
 'Greece',
 'Belgium',
 'India',
 'Spain',
 'Austria',
 'Colombia',
 'Puerto Rico',
 'United States',
 'Zambia',
 'Dominican Republic',
 'Iceland',
 'West Germany',
 'Japan',
 'New Zealand',
 'Canada',
 'China',
 'Peru',
 'Syria',
 'Ivory Coast',
 'Egypt',
 'Thailand',
 'Cameroon',
 'Chinese Taipei',
 'Algeria',
 'Turkey',
 'Portugal',
 'Pakistan',
 'Kenya',
 'Nigeria',
 'Norway',
 'South Korea',
 'Morocco',
 'Virgin Islands',
 'Netherlands Antilles',
 'Senegal',
 'Philippines',
 'Djibouti',
 'Suriname',
 'Costa Rica',
 'Indonesia',
 'Iran',
 'Argentina',
 'Chile',
 'Unified Team',
 'Germany',
 'Slovenia',
 'Bahamas',
 'Qatar',
 'Malaysia',
 'Ghana',
 'Latvia',
 'Lithuania',
 'Estonia',
 'Independent Olympic Participants',
 'Croatia',
 'Israel',
 'Namibia',
 'South Africa',
 'Kazakhstan',
 'Belarus',
 'Ukraine',
 'Russia',
 'Czech Republic',
 'Tonga',
 'Georgia',
 'Azerbaijan',
 'Trinidad and Tobago',
 'Mozambique',
 'Tunisia',
 'Uzbekistan',
 'Burundi',
 'Armenia',
 'Slovakia',
 'Moldova',
 'Hong Kong',
 'Ecuador',
 'Saudi Arabia',
 'Barbados',
 'Sri Lanka',
 'Vietnam',
 'Uruguay',
 'Kuwait',
 'Kyrgyzstan',
 'Macedonia',
 'Serbia and Montenegro',
 'United Arab Emirates',
 'Paraguay',
 'Eritrea',
 'Samoa',
 'Serbia',
 'Tajikistan',
 'Singapore',
 'Mauritius',
 'Togo',
 'Sudan',
 'Afghanistan',
 'Panama']

In [12]:
# create list of countries in population data
p_countries = list(new_pop_df['Country'].unique())
p_countries

['North America',
 'Bermuda',
 'Canada',
 'Greenland',
 'Mexico',
 'Saint Pierre and Miquelon',
 'United States',
 'Central & South America',
 'Antigua and Barbuda',
 'Argentina',
 'Aruba',
 'Bahamas, The',
 'Barbados',
 'Belize',
 'Bolivia',
 'Brazil',
 'Cayman Islands',
 'Chile',
 'Colombia',
 'Costa Rica',
 'Cuba',
 'Dominica',
 'Dominican Republic',
 'Ecuador',
 'El Salvador',
 'Falkland Islands (Islas Malvinas)',
 'French Guiana',
 'Grenada',
 'Guadeloupe',
 'Guatemala',
 'Guyana',
 'Haiti',
 'Honduras',
 'Jamaica',
 'Martinique',
 'Montserrat',
 'Netherlands Antilles',
 'Nicaragua',
 'Panama',
 'Paraguay',
 'Peru',
 'Puerto Rico',
 'Saint Kitts and Nevis',
 'Saint Lucia',
 'Saint Vincent/Grenadines',
 'Suriname',
 'Trinidad and Tobago',
 'Turks and Caicos Islands',
 'Uruguay',
 'Venezuela',
 'Virgin Islands,  U.S.',
 'Virgin Islands, British',
 'Europe',
 'Albania',
 'Austria',
 'Belgium',
 'Bosnia and Herzegovina',
 'Bulgaria',
 'Croatia',
 'Cyprus',
 'Czech Republic',
 'Denmark',
 'Faroe Islands',
 'Finland',
 'Former Czechoslovakia',
 'Former Serbia and Montenegro',
 'Former Yugoslavia',
 'France',
 'Germany',
 'Germany, East',
 'Germany, West',
 'Gibraltar',
 'Greece',
 'Hungary',
 'Iceland',
 'Ireland',
 'Italy',
 'Luxembourg',
 'Macedonia',
 'Malta',
 'Montenegro',
 'Netherlands',
 'Norway',
 'Poland',
 'Portugal',
 'Romania',
 'Serbia',
 'Slovakia',
 'Slovenia',
 'Spain',
 'Sweden',
 'Switzerland',
 'Turkey',
 'United Kingdom',
 'Eurasia',
 'Armenia',
 'Azerbaijan',
 'Belarus',
 'Estonia',
 'Former U.S.S.R.',
 'Georgia',
 'Kazakhstan',
 'Kyrgyzstan',
 'Latvia',
 'Lithuania',
 'Moldova',
 'Russia',
 'Tajikistan',
 'Turkmenistan',
 'Ukraine',
 'Uzbekistan',
 'Middle East',
 'Bahrain',
 'Iran',
 'Iraq',
 'Israel',
 'Jordan',
 'Kuwait',
 'Lebanon',
 'Oman',
 'Palestine',
 'Qatar',
 'Saudi Arabia',
 'Syria',
 'United Arab Emirates',
 'Yemen',
 'Africa',
 'Algeria',
 'Angola',
 'Benin',
 'Botswana',
 'Burkina Faso',
 'Burundi',
 'Cameroon',
 'Cape Verde',
 'Central African Republic',
 'Chad',
 'Comoros',
 'Congo (Brazzaville)',
 'Congo (Kinshasa)',
 'Cote dIvoire (IvoryCoast)',
 'Djibouti',
 'Egypt',
 'Equatorial Guinea',
 'Eritrea',
 'Ethiopia',
 'Gabon',
 'Gambia, The',
 'Ghana',
 'Guinea',
 'Guinea-Bissau',
 'Kenya',
 'Lesotho',
 'Liberia',
 'Libya',
 'Madagascar',
 'Malawi',
 'Mali',
 'Mauritania',
 'Mauritius',
 'Morocco',
 'Mozambique',
 'Namibia',
 'Niger',
 'Nigeria',
 'Reunion',
 'Rwanda',
 'Saint Helena',
 'Sao Tome and Principe',
 'Senegal',
 'Seychelles',
 'Sierra Leone',
 'Somalia',
 'South Africa',
 'Sudan',
 'Swaziland',
 'Tanzania',
 'Togo',
 'Tunisia',
 'Uganda',
 'Western Sahara',
 'Zambia',
 'Zimbabwe',
 'Asia & Oceania',
 'Afghanistan',
 'American Samoa',
 'Australia',
 'Bangladesh',
 'Bhutan',
 'Brunei',
 'Burma (Myanmar)',
 'Cambodia',
 'China',
 'Cook Islands',
 'Fiji',
 'French Polynesia',
 'Guam',
 'Hong Kong',
 'India',
 'Indonesia',
 'Japan',
 'Kiribati',
 'Korea, North',
 'Korea, South',
 'Laos',
 'Macau',
 'Malaysia',
 'Maldives',
 'Mongolia',
 'Nauru',
 'Nepal',
 'New Caledonia',
 'New Zealand',
 'Niue',
 'Pakistan',
 'Papua New Guinea',
 'Philippines',
 'Samoa',
 'Singapore',
 'Solomon Islands',
 'Sri Lanka',
 'Taiwan',
 'Thailand',
 'Timor-Leste (East Timor)',
 'Tonga',
 'U.S. Pacific Islands',
 'Vanuatu',
 'Vietnam',
 'World',
 'Hawaiian Trade Zone']

### Data Cleaning: Check for potential mismatched countries

In [13]:
# All countries in the Olympics data should be in the population data
# Loop to print countries that are in Olympics but not population data

for country in m_countries:
    if country not in p_countries:
        print(country)

Great Britain
East Germany
Soviet Union
North Korea
Czechoslovakia
Yugoslavia
West Germany
Ivory Coast
Chinese Taipei
South Korea
Virgin Islands
Unified Team
Bahamas
Independent Olympic Participants
Serbia and Montenegro

In [14]:
# Loop to print countries that are in population data but not Olympics
# This will help potentially identify the matching country from the Olympics data set above
for country in p_countries:
    if country not in m_countries:
        print(country)

North America
Bermuda
Greenland
Saint Pierre and Miquelon
Central & South America
Antigua and Barbuda
Aruba
Bahamas, The
Belize
Bolivia
Cayman Islands
Dominica
El Salvador
Falkland Islands (Islas Malvinas)
French Guiana
Grenada
Guadeloupe
Guatemala
Haiti
Honduras
Martinique
Montserrat
Nicaragua
Saint Kitts and Nevis
Saint Lucia
Saint Vincent/Grenadines
Turks and Caicos Islands
Virgin Islands,  U.S.
Virgin Islands, British
Europe
Albania
Bosnia and Herzegovina
Cyprus
Faroe Islands
Former Czechoslovakia
Former Serbia and Montenegro
Former Yugoslavia
Germany, East
Germany, West
Gibraltar
Luxembourg
Malta
Montenegro
United Kingdom
Eurasia
Former U.S.S.R.
Turkmenistan
Middle East
Bahrain
Iraq
Jordan
Oman
Palestine
Yemen
Africa
Angola
Benin
Botswana
Burkina Faso
Cape Verde
Central African Republic
Chad
Comoros
Congo (Brazzaville)
Congo (Kinshasa)
Cote dIvoire (IvoryCoast)
Equatorial Guinea
Gabon
Gambia, The
Guinea
Guinea-Bissau
Lesotho
Liberia
Libya
Madagascar
Malawi
Mali
Mauritania
Niger
Reunion
Rwanda
Saint Helena
Sao Tome and Principe
Seychelles
Sierra Leone
Somalia
Swaziland
Western Sahara
Asia & Oceania
American Samoa
Bangladesh
Bhutan
Brunei
Burma (Myanmar)
Cambodia
Cook Islands
Fiji
French Polynesia
Guam
Kiribati
Korea, North
Korea, South
Laos
Macau
Maldives
Nauru
Nepal
New Caledonia
Niue
Papua New Guinea
Solomon Islands
Taiwan
Timor-Leste (East Timor)
U.S. Pacific Islands
Vanuatu
World
Hawaiian Trade Zone

In [15]:
# Countries to rename in Population data to match with Olympics data
# 'United Kingdom' to 'Great Britain'
# 'Germany, East' to 'East Germany'
# 'Former U.S.S.R.' to 'Soviet Union'
# 'Korea, North' to 'North Korea'
# 'Former Czechoslovakia' to 'Czechoslovakia'
# 'Former Yugoslavia' to 'Yugoslavia'
# 'Germany, West' to 'West Germany'
# 'Cote dIvoire (IvoryCoast)' to 'Ivory Coast'
# 'Taiwan' to 'Chinese Taipei'
# 'Korea, South' to 'South Korea'
# 'Virgin Islands,  U.S.' to 'Virgin Islands'
# '' to 'Unified Team' ***This is related to dissolved Soviet Union territories in 1992
# 'Bahamas, The' to 'Bahamas'
# '' to 'Independent Olympic Participants' ***This is related to dissolved Soviet Union territories in 1992
# 'Former Serbia and Montenegro' to 'Serbia and Montenegro'

# dictionary with countries to rename
rename_dict = {
            'United Kingdom' : 'Great Britain',
            'Germany, East' : 'East Germany',
            'Former U.S.S.R.' : 'Soviet Union',
            'Korea, North' : 'North Korea',
            'Former Czechoslovakia' : 'Czechoslovakia',
            'Former Yugoslavia' : 'Yugoslavia',
            'Germany, West' : 'West Germany',
            'Cote dIvoire (IvoryCoast)' : 'Ivory Coast',
            'Taiwan' : 'Chinese Taipei',
            'Korea, South' : 'South Korea',
            'Virgin Islands,  U.S.' : 'Virgin Islands',
            'Bahamas, The' : 'Bahamas',
            'Former Serbia and Montenegro' : 'Serbia and Montenegro'
            }

# rename countries in population dataframe
new_pop_df = new_pop_df.replace({"Country": rename_dict})

# preview
new_pop_df.head()

   Year        Country Population
0  1980  North America  320.27638
1  1980        Bermuda    0.05473
2  1980         Canada    24.5933
3  1980      Greenland    0.05021
4  1980         Mexico   68.34748

In [16]:
# drop Unified Team and Independent Olympic Participants from Olympics dataframe
# these are groups that represent multiple countries that are not useful for our dataset

# remove Unified Team
new_medals_df = new_medals_df[new_medals_df['Country'] != 'Unified Team']

# remove Independent Olympic Participants
new_medals_df = new_medals_df[new_medals_df['Country'] != 'Independent Olympic Participants']

# drop Yugoslavia data after 1991 from combined dataframe. Further research showed athletes were allowed to compete
# under their flag, but there was no documented population as Yugoslavia was 'absorbed' by Serbia & Montenegro

# remove Yugoslavia after 1991. 
new_medals_df = new_medals_df.drop(new_medals_df[(new_medals_df['Country'] == 'Yugoslavia') & (new_medals_df['Year'] > 1991)].index)

# preview
new_medals_df.head()

     Year        Country  Gold  Silver  Bronze  Total
560  1980        Romania     6       6      13     25
561  1980        Hungary     7      10      15     32
562  1980         Sweden     3       3       6     12
563  1980         Poland     3      14      15     32
564  1980  Great Britain     5       7       9     21

In [17]:
# confirm there are no longer countries in Olympics dataframe that aren't in population dataframe

# create list of countries in olympics data
m_countries = list(new_medals_df['Country'].unique())

# recreate list of countries in population data
p_countries = list(new_pop_df['Country'].unique())

# Loop to print countries that are in Olympics but not population data

for country in m_countries:
    if country not in p_countries:
        print(country)

### Successfully cleaned data. All countries in Olympic data have a match in population data

### Merge the two dataframe on Year and Country

In [18]:
# check data types in olympics dataframe
new_medals_df.dtypes

Year        int64
Country    object
Gold        int64
Silver      int64
Bronze      int64
Total       int64
dtype: object

In [19]:
# check data types in population dataframe
new_pop_df.dtypes

Year          object
Country       object
Population    object
dtype: object

In [20]:
# change 'Year' datatype in population dataframe to integer to allow merge to occur
new_pop_df['Year'] = new_pop_df['Year'].astype(str).astype(int)

# change 'Population' datatype in population dataframe to float
new_pop_df['Population'] = pd.to_numeric(new_pop_df['Population'],errors = 'coerce')

# confirm change was successful
new_pop_df.dtypes

Year            int64
Country        object
Population    float64
dtype: object

In [21]:
# merge two dataframes
combined_df = pd.merge(new_medals_df, new_pop_df,  how='left', left_on=['Year','Country'], right_on = ['Year','Country'])

# preview
combined_df.head()

   Year        Country  Gold  Silver  Bronze  Total  Population
0  1980        Romania     6       6      13     25    22.13004
1  1980        Hungary     7      10      15     32    10.71112
2  1980         Sweden     3       3       6     12     8.31047
3  1980         Poland     3      14      15     32    35.57802
4  1980  Great Britain     5       7       9     21    56.51888

In [22]:
# check for null values
combined_df.isnull().values.sum()

0

In [23]:
# rename all columns to be all lowercase
# rename 'Country_Name' column to 'Country'
combined_df = combined_df.rename(columns=str.lower)

# preview
combined_df.head()

   year        country  gold  silver  bronze  total  population
0  1980        Romania     6       6      13     25    22.13004
1  1980        Hungary     7      10      15     32    10.71112
2  1980         Sweden     3       3       6     12     8.31047
3  1980         Poland     3      14      15     32    35.57802
4  1980  Great Britain     5       7       9     21    56.51888

### Connect to local database

In [24]:
protocol = 'postgresql'
username = 'postgres'
password = 'admin'
host = 'localhost'
database_name = 'olympics_db'
rds_connection_string = f'{protocol}://{username}:{password}@{host}/{database_name}'
engine = create_engine(rds_connection_string)

### Check for tables

In [25]:
engine.table_names()

/Users/jasonnoble/opt/anaconda3/envs/PythonData/lib/python3.7/site-packages/ipykernel_launcher.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  """Entry point for launching an IPython kernel.

['olympic_medals']

### Use pandas to load merged DataFrame into database

In [26]:
combined_df.to_sql(name='olympic_medals', con=engine, if_exists='replace', index=False)

### Confirm data has been added by querying the table
* NOTE: can also check using pgAdmin

In [27]:
pd.read_sql_query('select * from olympic_medals', con=engine).head()

   year        country  gold  silver  bronze  total  population
0  1980        Romania     6       6      13     25    22.13004
1  1980        Hungary     7      10      15     32    10.71112
2  1980         Sweden     3       3       6     12     8.31047
3  1980         Poland     3      14      15     32    35.57802
4  1980  Great Britain     5       7       9     21    56.51888